Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0064GPM028.PIC
      <edc:SFRDef edc:_addr="0x1F802620" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-01577_cla_clc_upb_v1_32bit.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLC4GLS" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CLC4GLS" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CLC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="G1D1N" edc:desc="" edc:mask="0x1" edc:name="G1D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D1T" edc:desc="" edc:mask="0x1" edc:name="G1D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D2N" edc:desc="" edc:mask="0x1" edc:name="G1D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D2T" edc:desc="" edc:mask="0x1" edc:name="G1D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D3N" edc:desc="" edc:mask="0x1" edc:name="G1D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D3T" edc:desc="" edc:mask="0x1" edc:name="G1D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D4N" edc:desc="" edc:mask="0x1" edc:name="G1D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G1D4T" edc:desc="" edc:mask="0x1" edc:name="G1D4T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D1N" edc:desc="" edc:mask="0x1" edc:name="G2D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D1T" edc:desc="" edc:mask="0x1" edc:name="G2D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D2N" edc:desc="" edc:mask="0x1" edc:name="G2D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D2T" edc:desc="" edc:mask="0x1" edc:name="G2D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D3N" edc:desc="" edc:mask="0x1" edc:name="G2D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D3T" edc:desc="" edc:mask="0x1" edc:name="G2D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D4N" edc:desc="" edc:mask="0x1" edc:name="G2D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G2D4T" edc:desc="" edc:mask="0x1" edc:name="G2D4T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D1N" edc:desc="" edc:mask="0x1" edc:name="G3D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D1T" edc:desc="" edc:mask="0x1" edc:name="G3D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D2N" edc:desc="" edc:mask="0x1" edc:name="G3D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D2T" edc:desc="" edc:mask="0x1" edc:name="G3D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D3N" edc:desc="" edc:mask="0x1" edc:name="G3D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D3T" edc:desc="" edc:mask="0x1" edc:name="G3D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D4N" edc:desc="" edc:mask="0x1" edc:name="G3D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G3D4T" edc:desc="" edc:mask="0x1" edc:name="G3D4T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802630" edc:offset="0x50"/>
      <edc:SFRDef edc:_addr="0x1F802680" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-03100_clk_cru_upb_v3_32bit.Module" edc:_refcount="1" edc:access="-----nnnn-n------rrr-nnnn--nn-nn" edc:cname="OSCCON" edc:desc="" edc:impl="0x7a0779b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0000-u------000-xxx0--00-x0" edc:name="OSCCON" edc:nzwidth="32" edc:por="-----0000-x------000-xxx0--00-x0" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x7" edc:name="COSC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SLP2SPD" edc:mask="0x1" edc:name="SLP2SPD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRMEN" edc:desc="" edc:mask="0x1" edc:name="DRMEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRCDIV" edc:desc="" edc:mask="0x7" edc:name="FRCDIV" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802690" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F8026A0" edc:_begin="0x20" edc:_end="0x30" edc:_modsrc="DOS-03100_clk_cru_upb_v3_32bit.Module" edc:_refcount="2" edc:access="-----nnn-nnnnnnn--------n-------" edc:cname="SPLLCON" edc:desc="" edc:impl="0x77f0080" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----001-xxxxxxx--------0-------" edc:name="SPLLCON" edc:nzwidth="32" edc:por="-----001-xxxxxxx--------0-------" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PLLICLK" edc:desc="" edc:mask="0x1" edc:name="PLLICLK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="PLLMULT" edc:desc="" edc:mask="0x7f" edc:name="PLLMULT" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PLLODIV" edc:desc="" edc:mask="0x7" edc:name="PLLODIV" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8026B0" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x1F8026E0" edc:_begin="0x50" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="1" edc:access="nn--nn----------------n-nn-nnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xcc0002df" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--00----------------0-00-00000" edc:name="RCON" edc:nzwidth="32" edc:por="00--00----------------0-00-00011" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CMR" edc:desc="" edc:mask="0x1" edc:name="CMR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="BCFGFAIL" edc:desc="" edc:mask="0x1" edc:name="BCFGFAIL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BCFGERR" edc:desc="" edc:mask="0x1" edc:name="BCFGERR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PORCORE" edc:mask="0x1" edc:name="PORCORE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORIO" edc:mask="0x1" edc:name="PORIO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x1d"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8026F0" edc:_begin="0x50" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="1" edc:access="-------------------------------w" edc:cname="RSWRST" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="RSWRST" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="" edc:mask="0x1" edc:name="SWRST" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802700" edc:_begin="0x50" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="1" edc:access="-------nn---n-nnnnnnnnnnnnnnnnnn" edc:cname="RNMICON" edc:desc="" edc:impl="0x18bffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------u0---0-000000000000000000" edc:name="RNMICON" edc:nzwidth="32" edc:por="-------x0---0-000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NMICNT" edc:desc="" edc:mask="0xffff" edc:name="NMICNT" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="WDTS" edc:desc="" edc:mask="0x1" edc:name="WDTS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LVD" edc:desc="" edc:mask="0x1" edc:name="LVD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GNMI" edc:mask="0x1" edc:name="GNMI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SWNMI" edc:desc="" edc:mask="0x1" edc:name="SWNMI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="WDTR" edc:mask="0x1" edc:name="WDTR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802710" edc:_begin="0x50" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="1" edc:access="-----------------------------nnn" edc:cname="PWRCON" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------000" edc:name="PWRCON" edc:nzwidth="32" edc:por="-----------------------------000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RETEN" edc:mask="0x1" edc:name="RETEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SBOREN" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802720" edc:_begin="0x50" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="1" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO1CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO1CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK1" edc:pos="14"/>
      </edc:SFRDef>
