Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0064GPM028.PIC
      <edc:SFRDef edc:_addr="0x1F802730" edc:_begin="0x50" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO1TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO1TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802740" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x1F802770" edc:_begin="0xd0" edc:_end="0xe0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="2" edc:access="------------------------r-rr-rnr" edc:cname="CLKSTAT" edc:desc="" edc:impl="0xb7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------u-uu-uuu" edc:name="CLKSTAT" edc:nzwidth="32" edc:por="------------------------0-00-0x0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRCRDY" edc:mask="0x1" edc:name="FRCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDIVRDY" edc:mask="0x1" edc:name="SPDIVRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSCRDY" edc:mask="0x1" edc:name="POSCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SOSCRDY" edc:mask="0x1" edc:name="SOSCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRCRDY" edc:mask="0x1" edc:name="LPRCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLRDY" edc:mask="0x1" edc:name="SPLLRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSPLLRDY" edc:mask="0x1" edc:name="DIVSPLLRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802780" edc:offset="0x100"/>
      <edc:SFRDef edc:_addr="0x1F802880" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02377_osc_rc8mhz_ctrl_upb_v2_32bit.Module" edc:_refcount="1" edc:access="----------------n-nnrnrn--nnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0xbf3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-000000--000000" edc:name="OSCTUN" edc:nzwidth="32" edc:por="----------------0-000000--000000" edc:portals="CLR SET INV" ltx:baseofperipheral="FRC">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ORPOL" edc:desc="" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OR" edc:desc="" edc:mask="0x1" edc:name="OR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="" edc:mask="0x1" edc:name="SRC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802890" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x1F802910" edc:_begin="0x8f0" edc:_end="0x900" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="1" edc:access="-----------------------------nn-" edc:cname="ANCFG" edc:desc="" edc:impl="0x6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------uu-" edc:name="ANCFG" edc:nzwidth="32" edc:por="-----------------------------xx-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BGCMP" edc:mask="0x1" edc:name="BGCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGADC" edc:mask="0x1" edc:name="BGADC" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VBGCMP" edc:mask="0x1" edc:name="VBGCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBGADC" edc:mask="0x1" edc:name="VBGADC" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802920" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02511_pwr_sib_upb_v1_32bit.Module" edc:_refcount="1" edc:access="----------------nnn-nnnn----nnnn" edc:cname="HLVDCON" edc:desc="" edc:impl="0xef0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-0000----0000" edc:name="HLVDCON" edc:nzwidth="32" edc:por="----------------000-0000----0000" edc:portals="CLR SET INV" ltx:baseofperipheral="HLVD">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HLVDL" edc:desc="" edc:mask="0xf" edc:name="HLVDL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HLEVT" edc:desc="" edc:mask="0x1" edc:name="HLEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IRVST" edc:desc="" edc:mask="0x1" edc:name="IRVST" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BGVST" edc:desc="" edc:mask="0x1" edc:name="BGVST" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VDIR" edc:desc="" edc:mask="0x1" edc:name="VDIR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="HLVD" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802930" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnrn--------nnnn" edc:cname="NVMCON" edc:desc="" edc:impl="0xf00f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--------0000" edc:name="NVMCON" edc:nzwidth="32" edc:por="----------------0000--------0000" edc:portals="CLR SET INV" ltx:baseofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMOP" edc:desc="" edc:mask="0xf" edc:name="NVMOP" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LVDERR" edc:desc="" edc:mask="0x1" edc:name="LVDERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802940" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMKEY" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:mask="0xffffffff" edc:name="NVMKEY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802950" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMADDR" edc:desc="" edc:mask="0xffffffff" edc:name="NVMADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802960" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA0" edc:desc="" edc:mask="0xffffffff" edc:name="NVMDATA0" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802970" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA1" edc:desc="" edc:mask="0xffffffff" edc:name="NVMDATA1" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802980" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMSRCADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMSRCADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMSRCADDR" edc:desc="" edc:mask="0xffffffff" edc:name="NVMSRCADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
