Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0064GPM028.PIC
      <edc:SFRDef edc:_addr="0x1F80F210" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--nnnnnnnn-nnnnnnnnnnnnn--------" edc:cname="IPC13" edc:desc="" edc:impl="0x3fdfff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0uuuuu00-uuuuu000uuuuu--------" edc:name="IPC13" edc:nzwidth="32" edc:por="--0xxxxx00-xxxxx000xxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="U1RXIS" edc:mask="0x3" edc:name="U1RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1RXIP" edc:mask="0x7" edc:name="U1RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U1TXIS" edc:mask="0x3" edc:name="U1TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1TXIP" edc:mask="0x7" edc:name="U1TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U1EIS" edc:mask="0x3" edc:name="U1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1EIP" edc:mask="0x7" edc:name="U1EIP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F220" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn--nnnnnnnn-nnnnnnnnnnnnn" edc:cname="IPC14" edc:desc="" edc:impl="0xff3fdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu--0uuuuu00-uuuuu000uuuuu" edc:name="IPC14" edc:nzwidth="32" edc:por="000xxxxx--0xxxxx00-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2RXIS" edc:mask="0x3" edc:name="U2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2RXIP" edc:mask="0x7" edc:name="U2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U2TXIS" edc:mask="0x3" edc:name="U2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2TXIP" edc:mask="0x7" edc:name="U2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U2EIS" edc:mask="0x3" edc:name="U2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2EIP" edc:mask="0x7" edc:name="U2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U3RXIS" edc:mask="0x3" edc:name="U3RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3RXIP" edc:mask="0x7" edc:name="U3RXIP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F230" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="-------------nnnnn-nnnnnnnnnnnnn" edc:cname="IPC15" edc:desc="" edc:impl="0x7dfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------00000-uuuuu000uuuuu" edc:name="IPC15" edc:nzwidth="32" edc:por="-------------00000-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIS" edc:mask="0x3" edc:name="U3TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3TXIP" edc:mask="0x7" edc:name="U3TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U3EIS" edc:mask="0x3" edc:name="U3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3EIP" edc:mask="0x7" edc:name="U3EIP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F240" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--nnnnnnnn-nnnnnnnnnnnnn--------" edc:cname="IPC16" edc:desc="" edc:impl="0x3fdfff1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0uuuuu00-uuuuu000uuuuu--------" edc:name="IPC16" edc:nzwidth="32" edc:por="--0xxxxx00-xxxxx000xxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="I2C1SIS" edc:mask="0x3" edc:name="I2C1SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1SIP" edc:mask="0x7" edc:name="I2C1SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C1MIS" edc:mask="0x3" edc:name="I2C1MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1MIP" edc:mask="0x7" edc:name="I2C1MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C1BCIS" edc:mask="0x3" edc:name="I2C1BCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1BCIP" edc:mask="0x7" edc:name="I2C1BCIP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F250" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn--nnnnnnnn-nnnnnnnnnnnnn" edc:cname="IPC17" edc:desc="" edc:impl="0xff3fdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu--0uuuuu00-uuuuu000uuuuu" edc:name="IPC17" edc:nzwidth="32" edc:por="000xxxxx--0xxxxx00-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C2SIS" edc:mask="0x3" edc:name="I2C2SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2SIP" edc:mask="0x7" edc:name="I2C2SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C2MIS" edc:mask="0x3" edc:name="I2C2MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2MIP" edc:mask="0x7" edc:name="I2C2MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C2BCIS" edc:mask="0x3" edc:name="I2C2BCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2BCIP" edc:mask="0x7" edc:name="I2C2BCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C3SIS" edc:mask="0x3" edc:name="I2C3SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3SIP" edc:mask="0x7" edc:name="I2C3SIP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F260" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn--nnnnnnnn-nnnnnnnnnnnnn" edc:cname="IPC18" edc:desc="" edc:impl="0xff3fdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu--0uuuuu00-uuuuu000uuuuu" edc:name="IPC18" edc:nzwidth="32" edc:por="000xxxxx--0xxxxx00-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3MIS" edc:mask="0x3" edc:name="I2C3MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3MIP" edc:mask="0x7" edc:name="I2C3MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C3BCIS" edc:mask="0x3" edc:name="I2C3BCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3BCIP" edc:mask="0x7" edc:name="I2C3BCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCP1IS" edc:mask="0x3" edc:name="CCP1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP1IP" edc:mask="0x7" edc:name="CCP1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT1IS" edc:mask="0x3" edc:name="CCT1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT1IP" edc:mask="0x7" edc:name="CCT1IP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F270" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn--nnnnnnnn-nnnnnnnnnnnnn" edc:cname="IPC19" edc:desc="" edc:impl="0xff3fdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu--0uuuuu00-uuuuu000uuuuu" edc:name="IPC19" edc:nzwidth="32" edc:por="000xxxxx--0xxxxx00-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCP2IS" edc:mask="0x3" edc:name="CCP2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP2IP" edc:mask="0x7" edc:name="CCP2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT2IS" edc:mask="0x3" edc:name="CCT2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT2IP" edc:mask="0x7" edc:name="CCT2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCP3IS" edc:mask="0x3" edc:name="CCP3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP3IP" edc:mask="0x7" edc:name="CCP3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT3IS" edc:mask="0x3" edc:name="CCT3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT3IP" edc:mask="0x7" edc:name="CCT3IP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F280" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn--nnnnnnnn-nnnnnnnnnnnnn" edc:cname="IPC20" edc:desc="" edc:impl="0xff3fdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu--0uuuuu00-uuuuu000uuuuu" edc:name="IPC20" edc:nzwidth="32" edc:por="000xxxxx--0xxxxx00-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCP4IS" edc:mask="0x3" edc:name="CCP4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP4IP" edc:mask="0x7" edc:name="CCP4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT4IS" edc:mask="0x3" edc:name="CCT4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT4IP" edc:mask="0x7" edc:name="CCT4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCP5IS" edc:mask="0x3" edc:name="CCP5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP5IP" edc:mask="0x7" edc:name="CCP5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT5IS" edc:mask="0x3" edc:name="CCT5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT5IP" edc:mask="0x7" edc:name="CCT5IP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
